---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Lighting.LineLightShape
source: html/e82625ef-d9ba-b5ca-b52a-02ab38ef59c7.htm
---
# LineLightShape Members

Creates a line light shape object with 2.0' emit length.